tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "snyk/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Asynchronous DNS library
brew "c-ares"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# HTTP/2 C Library
brew "libnghttp2"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Open source continuous file synchronization application
brew "syncthing", restart_service: true, link: false
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Real-time strategy game
cask "0-ad"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Web security testing toolkit
cask "burp-suite"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Calendar for professionals and teams
cask "cron"
# Trains AIs to understand and translate texts
cask "deepl"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-source-code-pro-for-powerline"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# Password manager app
cask "keepassxc"
# Software for Logitech devices
cask "logi-options-plus"
# Clipboard manager
cask "maccy"
# Web browser
cask "microsoft-edge"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# VPN client focusing on security
cask "protonvpn"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Email client
cask "readdle-spark"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# Spotify and iTunes in the menu bar
cask "spotmenu"
# Text editor for code, markup and prose
cask "sublime-text"
# Real time file synchronization software
cask "syncthing"
# LaTeX editor
cask "texmaker"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Handwriting notetaking software
cask "xournal-plus-plus"
# Video communication and virtual meeting platform
cask "zoom"
vscode "astro-build.astro-vscode"
vscode "Blackboxapp.blackbox"
vscode "csstools.postcss"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.heygithub"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "PKief.material-icon-theme"
vscode "pnp.polacode"
vscode "ritwickdey.LiveServer"
vscode "styled-components.vscode-styled-components"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "wesbos.theme-cobalt2"
vscode "xabikos.JavaScriptSnippets"
